[
  {
    "Field": "Company Name",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Your full legal company name",
    "Considerations": "The company’s legal name as you want it to appear on documents. Typically set during company creation.",
    "BC Field Name": "Name",
    "Question": "What is your company's full legal name?",
    "common": "Very Common"
  },
  {
    "Field": "Address",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Company street address",
    "Considerations": "Enter the primary street address for the company. In the US this is typically a street name. If a second address line is needed, use the Address 2 field. Ensure formatting is how you want it to print on forms.",
    "BC Field Name": "Address",
    "Question": "What is your company's primary street address?",
    "common": "Very Common"
  },
  {
    "Field": "City",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "City name",
    "Considerations": "Enter the city for the company address. This will appear on documents (e.g. City, State ZIP).",
    "BC Field Name": "City",
    "Question": "What city is the company located in?",
    "common": "Very Common"
  },
  {
    "Field": "State",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "State/Province code or name",
    "Considerations": "Enter the state or region for the address (e.g. two-letter state code in the US). It prints after the city (City, State ZIP) on forms. Ensure consistency (abbreviation vs full name) with company standards.",
    "Comment": "Corresponds to the \"County\" field in Business Central (US context uses it for State).",
    "BC Field Name": "County",
    "Question": "Which state or province is the company in? (Use standard abbreviation.)",
    "common": "Very Common"
  },
  {
    "Field": "ZIP Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Postal code",
    "Considerations": "Enter the postal code. In the US, use the 5-digit ZIP (plus 4 if applicable). It will appear after the state in the address.",
    "Comment": "Corresponds to the \"Post Code\" field.",
    "BC Field Name": "Post Code",
    "Question": "What is the company's ZIP or postal code?",
    "common": "Very Common"
  },
  {
    "Field": "Phone No.",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Main company phone number",
    "Considerations": "Provide the primary contact telephone number for the company. This appears on reports (e.g. invoices) as the company contact phone.",
    "BC Field Name": "Phone No.",
    "Question": "What is the company's main phone number?",
    "common": "Very Common"
  },
  {
    "Field": "Email",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "General company email address",
    "Considerations": "Provide a generic contact email (e.g. info@yourcompany.com) for the company. This will be used on documents like invoices as the main email contact.",
    "Comment": "Corresponds to the \"E-Mail\" field.",
    "BC Field Name": "E-Mail",
    "Question": "What is the general contact email address for the company?",
    "common": "Very Common"
  },
  {
    "Field": "Country/Region Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "US (for United States)",
    "Considerations": "Use the standard country/region code (e.g. \"US\"). This affects address formatting and tax settings. If left blank, the system assumes the local country format by default.",
    "BC Field Name": "Country/Region Code",
    "Question": "What is the country/region code for the company's address? (e.g., 'US')",
    "common": "Very Common",
    "Lookup Table": 9,
    "Lookup Field": "Code"
  },
  {
    "Field": "Tax Registration No.",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Your tax ID (EIN) or VAT number",
    "Considerations": "If applicable, enter the company’s tax registration number. In the US, this could be the Employer Identification Number (EIN) if you want it to appear on documents. In VAT countries, this would be the VAT registration number. Leave blank if not applicable.",
    "Comment": "This corresponds to the \"VAT Registration No.\" field (used for EIN in US if needed).",
    "BC Field Name": "VAT Registration No.",
    "Question": "If applicable, what is the company's tax registration number (e.g., EIN or VAT number)?",
    "common": "Very Common"
  },
  {
    "Field": "Fed. Tax ID (if available)",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Your Federal Tax ID (EIN)",
    "Considerations": "Enter the Federal Tax Identification Number if your localization provides a separate field for it (often used in the US for 1099 reporting). Leave blank if not required or not available.",
    "Comment": "Only in some localizations (e.g. US). Corresponds to the \"EIN Number\" field.",
    "BC Field Name": "EIN Number",
    "Question": "If your localization uses a federal tax ID, what is the company's Federal Tax ID (EIN)?",
    "common": "Very Common"
  },
  {
    "Field": "Company Website",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Your website URL",
    "Considerations": "Optional. If provided, the company website URL can be printed on outgoing documents. Leave blank if not needed.",
    "Comment": "This is the \"Home Page\" field in Business Central.",
    "BC Field Name": "Home Page",
    "Question": "What is the company's website URL? (Leave blank if not to be included on documents.)",
    "common": "Very Common"
  },
  {
    "Field": "Base Calendar Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "e.g. STANDARD (if using a base calendar)",
    "Considerations": "Optional. Assign a base calendar (working days/holidays) code if the company uses one for date calculations (like delivery date calculations or order promising). The calendar must be set up separately. If left blank, no base calendar is applied.",
    "BC Field Name": "Base Calendar Code",
    "Question": "Does the company use a base calendar for working days/holidays? If yes, what is the base calendar code?",
    "common": "Sometimes",
    "Lookup Table": 760,
    "Lookup Field": "Code"
  },
  {
    "Field": "Invoice Address Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "(Usually blank)",
    "Considerations": "If the company’s remit-to or payment address is different from the main address, enter the code for an alternate address here. Typically this remains blank, indicating that the main company address is used for invoices.",
    "Comment": "Alternate address code, if applicable. Leave blank if using the primary address.",
    "BC Field Name": "Invoice Address Code",
    "Question": "If the company has a different address for invoices/payments, what is the code for that alternate address? (Otherwise leave blank.)",
    "common": "Sometimes"
  },
  {
    "Field": "Logo (Picture)",
    "FieldType": "Blob",
    "DefaultValue": "(None)",
    "RecommendedSetting": "Upload your logo image",
    "Considerations": "You can upload a company logo image here to appear on reports (invoices, etc.). Use a reasonably sized image for clarity without inflating report size.",
    "BC Field Name": "Picture",
    "Question": "Do you want to upload a company logo for documents? (If yes, you can upload the logo image in this field.)",
    "common": "Very Common"
  },
  {
    "Field": "Allow Posting From",
    "FieldType": "Date",
    "DefaultValue": "01/01/20xx (or Blank)",
    "RecommendedSetting": "The start date of the open fiscal period",
    "Considerations": "Defines the earliest posting date allowed. Initially this may be blank or a broad date (e.g. beginning of the fiscal year). It's recommended to set this to the first day of the current open fiscal period to prevent postings before that period. Update as periods close or open. (User-specific posting date ranges can also override this via User Setup.)",
    "BC Field Name": "Allow Posting From",
    "Question": "From which date should the system allow financial postings? (Usually the start of the current fiscal period.)",
    "common": "Sometimes"
  },
  {
    "Field": "Allow Posting To",
    "FieldType": "Date",
    "DefaultValue": "12/31/20xx (or Blank)",
    "RecommendedSetting": "The end date of the open fiscal period",
    "Considerations": "Defines the latest posting date allowed. Initially this may be blank or set far in the future (e.g. end of fiscal year). It's recommended to set this to the last day of the current open period to prevent future-dated postings beyond the open period. Adjust this date as new periods open or current period closes. (Can also be controlled per user in User Setup.)",
    "BC Field Name": "Allow Posting To",
    "Question": "Until which date should the system allow financial postings? (Usually the end of the current fiscal period.)",
    "common": "Sometimes"
  },
  {
    "Field": "Register Time",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (usually)",
    "Considerations": "If enabled, the system records a timestamp on ledger entries when posting (capturing the time of posting). By default this is off. In the US, precise posting time is typically not required, so leaving this off is fine unless auditing requirements demand timestamps on entries.",
    "BC Field Name": "Register Time",
    "Question": "Should the system time-stamp entries when posting (Register Time)? (Yes/No)",
    "common": "Sometimes"
  },
  {
    "Field": "Allow Deferral Posting From",
    "FieldType": "Date",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Blank (unless restricting deferrals)",
    "Considerations": "Defines the earliest date for deferral postings (from deferral templates that spread revenue/expenses over time). Usually left blank (no restriction). Set a date here only if you need to prevent deferral entries from being posted before a certain date.",
    "BC Field Name": "Allow Deferral Posting From",
    "Question": "If using deferrals, from what date are deferral postings allowed? (Leave blank for no restriction.)",
    "Common Choices": [
      "01/01/20XX",
      "Fiscal Year Start",
      "Custom Date"
    ],
    "common": "Sometimes"
  },
  {
    "Field": "Allow Deferral Posting To",
    "FieldType": "Date",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Blank (or set a limit if using deferrals)",
    "Considerations": "Defines the latest date for deferral postings. Commonly left blank (no end-date restriction) unless you want to disallow deferrals beyond a specific date (for example, to stop deferrals from extending past a cutoff).",
    "BC Field Name": "Allow Deferral Posting To",
    "Question": "If using deferrals, up to what date are deferral postings allowed? (Leave blank for no restriction.)",
    "Common Choices": [
      "12/31/20XX",
      "Fiscal Year End",
      "Custom Date"
    ],
    "common": "Sometimes"
  },
  {
    "Field": "Local Currency (LCY) Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "USD (for a US company)",
    "Considerations": "Set the local currency code of the company. For a US company, this should be \"USD\". This setting is critical for multi-currency and influences rounding rules. Once transactions exist in the system, changing the LCY code is not recommended (to avoid inconsistencies).",
    "BC Field Name": "LCY Code",
    "Question": "What is the local currency code for the company? (e.g., 'USD')",
    "Common Choices": [
      "USD",
      "EUR",
      "GBP",
      "JPY",
      "CHF",
      "AUD",
      "CAD",
      "NZD",
      "CNY",
      "SEK",
      "NOK",
      "DKK",
      "INR",
      "RUB",
      "BRL",
      "ZAR",
      "HKD",
      "SGD",
      "MXN"
    ],
    "common": "Sometimes",
    "Lookup Table": 4,
    "Lookup Field": "Code"
  },
  {
    "Field": "EMU Currency",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (True only if in Eurozone)",
    "Considerations": "This primarily applies to European Monetary Union countries using the Euro. In a US context, leave this off. (If enabled, it indicates the company’s local currency is part of the EMU and can trigger specific Euro-related handling.)",
    "BC Field Name": "EMU Currency",
    "Question": "Is the local currency part of the Euro (EMU)? (Yes only if company uses Euro.)",
    "common": "Sometimes"
  },
  {
    "Field": "Additional Reporting Currency",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "If the company needs financial reports in another currency (for example, a parent company’s currency), specify that currency code here. Typically left blank for US companies unless a secondary reporting currency is required. When set, the system will maintain parallel posting amounts in that currency.",
    "BC Field Name": "Add.-Reporting Currency",
    "Question": "If a secondary reporting currency is needed, what is the currency code? (Otherwise leave blank.)",
    "Common Choices": [
      "USD",
      "EUR",
      "GBP",
      "JPY"
    ],
    "common": "Sometimes",
    "Lookup Table": 4,
    "Lookup Field": "Code"
  },
  {
    "Field": "Amount Decimal Places",
    "FieldType": "Text",
    "DefaultValue": "2:2",
    "RecommendedSetting": "2:2 (for USD)",
    "Considerations": "Controls how many decimal places amounts are displayed and stored with. \"2:2\" means always show 2 decimals (e.g. $1.00). In the US, currency is in two decimal places, so 2:2 is standard. Only adjust this if the local currency has a different minor unit or if more precision is needed for some reason.",
    "BC Field Name": "Amount Decimal Places",
    "Question": "How many decimal places should amounts be displayed in? (Typically 2 for USD.)",
    "Common Choices": [
      "0:2",
      "2:2",
      "2:4"
    ],
    "common": "Sometimes"
  },
  {
    "Field": "Unit-Amount Decimal Places",
    "FieldType": "Text",
    "DefaultValue": "2:2",
    "RecommendedSetting": "2:2 (or 2:5 if greater precision needed)",
    "Considerations": "Sets the decimal precision for unit prices or rates. Default is 2:2 (two decimals). You can allow a range by specifying a minimum:maximum, for example 2:5 if certain unit prices require up to 5 decimal places (e.g. fuel prices per gallon). Keep at least 2 for currency compatibility. Use higher precision only if needed for pricing accuracy.",
    "BC Field Name": "Unit-Amount Decimal Places",
    "Question": "What is the decimal precision for unit prices/amounts? (e.g., 2:2 or 2:5 if more precision needed.)",
    "Common Choices": [
      "0:2",
      "2:2",
      "2:4"
    ],
    "common": "Sometimes"
  },
  {
    "Field": "Amount Rounding Precision",
    "FieldType": "Decimal",
    "DefaultValue": "0.01",
    "RecommendedSetting": "0.01",
    "Considerations": "The smallest increment to which amounts are rounded. $0.01 (one cent) is standard for USD. Do not change this unless dealing with a currency that has a different smallest unit (for example, a currency that rounds to the nearest 0.05).",
    "BC Field Name": "Amount Rounding Precision",
    "Question": "What rounding precision should amounts use? (For USD, 0.01.)",
    "common": "Sometimes"
  },
  {
    "Field": "Invoice Rounding Precision (LCY)",
    "FieldType": "Decimal",
    "DefaultValue": "1.00 (or 0.01)",
    "RecommendedSetting": "0.01 (usually) or 1.00 if needed",
    "Considerations": "The increment to which invoice totals are rounded. Many U.S. companies do not use invoice-level rounding, so setting this to $0.01 effectively means no special rounding beyond normal cents. Setting it to $1.00 (with an appropriate rounding type) would round invoice totals to whole dollars, which is uncommon in the US. Generally leave at 0.01 unless there is a specific need for whole-unit rounding.",
    "BC Field Name": "Invoice Rounding Precision (LCY)",
    "Question": "If using invoice rounding, to what increment should invoice totals round? (e.g., 0.01 or 1.00)",
    "common": "Sometimes"
  },
  {
    "Field": "Invoice Rounding Type (LCY)",
    "FieldType": "Option",
    "DefaultValue": "Nearest",
    "RecommendedSetting": "Nearest",
    "Considerations": "Specifies how to round amounts if Invoice Rounding Precision is greater than the smallest currency unit. \"Nearest\" rounds .5 upward (standard rounding). Other options include \"Up\" (always round up) or \"Down\" (always down). In the US, since invoice rounding precision is typically $0.01, this setting has little effect. If using a larger rounding (like $1.00), Nearest is generally recommended so that .50 rounds up. Use other options only if there's a specific policy.",
    "BC Field Name": "Invoice Rounding Type (LCY)",
    "Question": "If invoice rounding is used, how should amounts be rounded? (Nearest, Up, Down?)",
    "common": "Sometimes"
  },
  {
    "Field": "Summarize G/L Entries",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (or On per preference)",
    "Considerations": "If enabled, the system will consolidate multiple G/L entries from a single posting into one line per G/L account, reducing the level of detail in the general ledger. The default is off, preserving detailed line-by-line entries for audit trail purposes. It’s recommended to leave this Off to maintain detailed transaction history. Turn it On only if a simpler, summarized G/L is desired (for example, to reduce entry counts), understanding that detail will be lost.",
    "BC Field Name": "Summarize G/L Entries",
    "Question": "Should the system summarize G/L entries when posting (combine entries per account)?",
    "common": "Sometimes"
  },
  {
    "Field": "Mark Cr. Memos as Corrections",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On",
    "Considerations": "When True, sales and purchase credit memos are flagged as correction documents. This causes them to post with reversed signs and link to the original invoice entries (so they negate the invoice rather than adding separate positive entries). By default this is on and is the standard accounting treatment for credits. It’s recommended to keep it enabled to ensure credit memos properly offset original invoices and to simplify reporting netted values.",
    "BC Field Name": "Mark Cr. Memos as Corrections",
    "Question": "Should sales and purchase credit memos be marked as corrections (reversals of the original invoices)?",
    "common": "Sometimes"
  },
  {
    "Field": "Allow G/L Acc. Deletion Before",
    "FieldType": "Date",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set a cut-off date far in the past",
    "Considerations": "If blank, there is no restriction on deleting General Ledger accounts. It's wise to set this to an old date (for example, the company’s inception date or a date like 01/01/1900) to prevent deletion of any G/L account that has entries dated on or before that date. This effectively blocks removal of accounts that have historical transactions, helping maintain data integrity. If you do set it, use a date earlier than any existing entries in your system.",
    "BC Field Name": "Allow G/L Acc. Deletion Before",
    "Question": "What cutoff date should prevent deletion of G/L accounts with entries on or before that date? (Use a very old date to block deletion of any account with history.)",
    "common": "Sometimes"
  },
  {
    "Field": "Block Deletion of G/L Accounts",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On (True)",
    "Considerations": "If enabled, the system will prevent any G/L account from being deleted if it has ever been posted to (has ledger entries). It is strongly recommended to turn this On in production. This provides a safeguard so that accounts with historical entries cannot be removed, thereby preserving financial history. (This is in addition to any date-based restrictions above.)",
    "BC Field Name": "Block Deletion of G/L Accounts",
    "Question": "Should the system block deletion of any G/L account that has been posted to in the past? (Recommended Yes.)",
    "common": "Sometimes"
  },
  {
    "Field": "Acc. Sched. for Retained Earn.",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "(Blank unless used)",
    "Considerations": "Specifies the Account Schedule code that defines how retained earnings are calculated for financial statements. Often left blank in the US, as retained earnings is typically handled via a manual closing entry at year-end. If the company uses an account schedule to automatically calculate retained earnings in reports, enter that account schedule’s code here; otherwise leave it blank.",
    "Comment": "Field for specifying an account schedule for retained earnings (financial reporting).",
    "BC Field Name": "Acc. Sched. Name for Ret. Earn.",
    "Question": "If using an Account Schedule to calculate retained earnings, what is its code? (Otherwise leave blank.)",
    "common": "Sometimes",
    "Lookup Table": 84,
    "Lookup Field": "Name"
  },
  {
    "Field": "Fin. Rep. for Retained Earn.",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "(Blank unless used)",
    "Considerations": "Specifies the Financial Report (or report definition code) that includes retained earnings calculation. Typically left blank in the US. If using a specific financial report definition to calculate/close out retained earnings in statements, set the code; otherwise leave blank and handle retained earnings via the standard closing process.",
    "Comment": "Field for specifying a financial report code for retained earnings (financial reporting).",
    "BC Field Name": "Fin. Rep. for Retained Earn.",
    "Question": "If using a Financial Report definition for retained earnings, what is its code? (Otherwise leave blank.)",
    "common": "Unlikely",
    "Lookup Table": 88,
    "Lookup Field": "Name"
  },
  {
    "Field": "Global Dimension 1 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "e.g. DEPARTMENT (most-used dimension)",
    "Considerations": "Choose the code for the primary company-wide (global) dimension. Global dimensions are available on every transaction and for filtering in reports. Common choices include Department, Project, Business Unit, etc. Decide this early, because changing a global dimension later requires a data migration process. Once set, this dimension will appear in many pages and be usable as a filter widely.",
    "BC Field Name": "Global Dimension 1 Code",
    "Question": "Which dimension should be Global Dimension 1 (primary)? Provide its code (e.g., DEPARTMENT).",
    "common": "Very Common",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Global Dimension 2 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "e.g. PROJECT (second key dimension)",
    "Considerations": "Choose the code for the second global dimension. Like Global Dimension 1, this will be carried on every transaction and can be used in filtering and reporting. Commonly this might be another major grouping like Project, Product Line, or Region (depending on what Global 1 was). Set during initial configuration; changing later is difficult and involves data transformation.",
    "BC Field Name": "Global Dimension 2 Code",
    "Question": "Which dimension should be Global Dimension 2 (secondary)? Provide its code (e.g., PROJECT).",
    "common": "Very Common",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 3 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed (otherwise blank)",
    "Considerations": "If the company uses more than two analysis dimensions, assign a code for the third dimension here. Shortcut Dimensions 3-8 are additional dimensions beyond the two global ones; they are available to use on entries but are not global filters. If you only need two dimensions total, leave dimensions 3 (and others beyond 2) blank.",
    "BC Field Name": "Shortcut Dimension 3 Code",
    "Question": "If using a 3rd analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 4 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "Code for an additional analysis dimension (fourth). Use if tracking a fourth dimension on entries is required. If not needed, leave blank.",
    "BC Field Name": "Shortcut Dimension 4 Code",
    "Question": "If using a 4th analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 5 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "Fifth analysis dimension code, if utilized. Leave blank if not in use.",
    "BC Field Name": "Shortcut Dimension 5 Code",
    "Question": "If using a 5th analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 6 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "Sixth analysis dimension code. Provide a code if a sixth dimension is tracked on entries; otherwise blank.",
    "BC Field Name": "Shortcut Dimension 6 Code",
    "Question": "If using a 6th analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 7 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "Seventh analysis dimension code. Only assign if a seventh dimension is required by the business; leave blank if not.",
    "BC Field Name": "Shortcut Dimension 7 Code",
    "Question": "If using a 7th analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Shortcut Dimension 8 Code",
    "FieldType": "Code",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Set if needed",
    "Considerations": "Eighth (maximum) analysis dimension code. Use this field if tracking an eighth dimension on entries is necessary. Leave blank if not used.",
    "BC Field Name": "Shortcut Dimension 8 Code",
    "Question": "If using an 8th analysis dimension, what is its code? (Leave blank if not used.)",
    "common": "Sometimes",
    "Lookup Table": 348,
    "Lookup Field": "Code"
  },
  {
    "Field": "Unrealized VAT",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (for US)",
    "Considerations": "Indicates whether to use unrealized VAT (posting VAT to a temporary account until payment is received). Not used in U.S. sales tax scenarios, so it should remain Off in the US. In countries with VAT, if enabled, VAT on open invoices can be handled as unrealized (deferred) until payment. In the US context, leave this Off.",
    "BC Field Name": "Unrealized VAT",
    "Question": "Will the company use unrealized VAT (defer VAT until payment is received)? (In US, typically No.)",
    "common": "Sometimes"
  },
  {
    "Field": "VAT Tolerance %",
    "FieldType": "Decimal",
    "DefaultValue": "0",
    "RecommendedSetting": "0 (leave default)",
    "Considerations": "The percentage threshold for allowable differences in VAT amounts (due to rounding or minor discrepancies). Not applicable to US sales tax. This is typically left at 0 unless dealing with minor allowed differences in VAT calculations in VAT jurisdictions. In the US, leave as 0 (no tolerance).",
    "BC Field Name": "VAT Tolerance %",
    "Question": "What VAT tolerance percentage is allowed for minor differences? (Usually 0% in US.)",
    "common": "Sometimes"
  },
  {
    "Field": "Max. VAT Difference Allowed",
    "FieldType": "Decimal",
    "DefaultValue": "0",
    "RecommendedSetting": "0 (leave default)",
    "Considerations": "The maximum absolute amount of VAT difference allowed during posting. In a VAT environment, this would let small rounding differences post without error. Not relevant for US sales tax (which uses exact calculations per tax area). Leave at 0 in US context.",
    "BC Field Name": "Max. VAT Difference Allowed",
    "Question": "What is the maximum VAT amount difference allowed? (Usually 0 in US.)",
    "common": "Sometimes"
  },
  {
    "Field": "VAT Calculation Type",
    "FieldType": "Option",
    "DefaultValue": "(Default option, e.g. Bill-to)",
    "RecommendedSetting": "Default (no change)",
    "Considerations": "Determines whether VAT is calculated based on the Bill-to or Sell-to address in scenarios like EU cross-border sales. This setting (Bill-to/Sell-to VAT Calc.) is generally not applicable in the US. Leave it at the default (typically Bill-to) unless dealing with VAT scenarios where this matters.",
    "Comment": "This corresponds to the \"Bill-to/Sell-to VAT Calc.\" field in GL Setup, mainly used in EU VAT scenarios.",
    "BC Field Name": "Bill-to/Sell-to VAT Calc.",
    "Question": "Should VAT be calculated based on the Bill-to address or the Sell-to address? (Typically Bill-to.)",
    "common": "Sometimes"
  },
  {
    "Field": "Email Logging Enabled",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (enable only if using Email Logging)",
    "Considerations": "Controls whether the Email Logging feature is active. Default is off. If set to On, Business Central will attempt to log emails from Exchange as interactions (requires additional setup). Turn this on only after you have configured the Exchange integration (client ID/secret) and want to capture email communications in the system; otherwise keep it off.",
    "BC Field Name": "Email Logging Enabled",
    "Question": "Do you want to enable the Email Logging feature (to track emails in Business Central)?",
    "common": "Sometimes"
  },
  {
    "Field": "Exchange Client Id",
    "FieldType": "Text",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Client ID from Azure AD app (if using email logging)",
    "Considerations": "If using Email Logging, enter the Azure AD application’s Client ID here. This is obtained when you register an app in Azure for Business Central to access Exchange. Leave blank if email logging is not being used.",
    "Comment": "Field to input the Exchange Integration Client ID (for Email Logging).",
    "BC Field Name": "Exchange Client Id",
    "Question": "If Email Logging is used, what is the Azure AD Application (Client) ID for the Exchange integration?",
    "common": "Unlikely"
  },
  {
    "Field": "Exchange Client Secret Key",
    "FieldType": "Guid",
    "DefaultValue": "(Blank)",
    "RecommendedSetting": "Azure app secret (stored securely)",
    "Considerations": "If using Email Logging, this field stores the encrypted secret key for the Azure AD application. When you set up the email logging, you will input the client secret which gets saved securely (as a Guid reference or encrypted string). Leave blank if not using the feature.",
    "Comment": "Stored securely (not visible) – corresponds to the app registration secret for Exchange integration.",
    "BC Field Name": "Exchange Client Secret Key",
    "Question": "If Email Logging is used, what is the Client Secret key for the Azure AD application? (It will be stored securely.)",
    "common": "Unlikely"
  },
  {
    "Field": "Discount Posting",
    "FieldType": "Option",
    "DefaultValue": "All Discounts (or No Discounts, depending on localization)",
    "RecommendedSetting": "All Discounts",
    "Considerations": "Determines how sales discounts are posted to the G/L. Options: No Discounts (discounts are not posted separately, they reduce revenue directly), Invoice Discounts (only invoice-level discounts post to a separate account, line discounts are netted), Line Discounts (line-level discounts post separately, invoice discounts are netted), All Discounts (both invoice and line discounts post to their respective discount accounts). The default is often All Discounts (ensuring both types of discounts post to proper accounts). It is recommended to use All Discounts so you can track total discounts given in dedicated accounts. If you prefer to net discounts into sales, you could choose No Discounts, but you would lose visibility of discount amounts in the ledger.",
    "BC Field Name": "Discount Posting",
    "Question": "How should sales discounts be posted to the G/L? (Options: No Discounts, Invoice Discounts, Line Discounts, All Discounts.)",
    "common": "Sometimes"
  },
  {
    "Field": "Credit Warnings",
    "FieldType": "Option",
    "DefaultValue": "No Warning",
    "RecommendedSetting": "Both Warnings",
    "Considerations": "Specifies whether the system warns about a customer's credit status when creating sales orders or invoices. Options: No Warning (no automatic credit checks), Credit Limit (warn if the customer’s current balance exceeds their credit limit), Overdue Balance (warn if the customer has any overdue invoices), Both Warnings (warn if either condition is true). The default may be No Warning. It's usually recommended to set this to Both Warnings to alert users if a customer is over their credit limit or has overdue balances. This provides a prompt to review the situation, though it does not block posting by default. (Ensure customer Credit Limits and aging are maintained for these warnings to be meaningful.)",
    "BC Field Name": "Credit Warnings",
    "Question": "What credit warnings should be shown for customers? (No Warning, Credit Limit, Overdue Balance, Both.)",
    "common": "Sometimes"
  },
  {
    "Field": "Stockout Warning",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On (True)",
    "Considerations": "If enabled, the user will receive a warning when entering a sales line that would drive the item’s inventory below zero (a potential stockout). By default this is True. It’s recommended to keep it On so that users are alerted to potential backorder or stock issues while processing orders. (Note: This is only a warning. The actual ability to post negative inventory is controlled by a setting in Inventory Setup. Even with this warning, the system can post negative inventory if allowed in Inventory Setup.)",
    "BC Field Name": "Stockout Warning",
    "Question": "Should a warning pop up if a sales order would cause negative inventory (stockout)?",
    "common": "Sometimes"
  },
  {
    "Field": "Shipment on Invoice",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On (or adjust per process)",
    "Considerations": "When this is On, posting a sales invoice will automatically post the shipment for that order simultaneously (i.e., you invoice and ship in one step). The default is usually On, which is convenient if the company invoices orders directly (typical for businesses without separate warehouse shipment processes). If warehousing is handled separately (i.e., shipments are posted by a warehouse before invoicing), set this to Off. In that case, users must post shipments first, then post the invoices. Choose Off if your process requires separate shipment posting; otherwise, keeping it On simplifies combined invoicing/shipping.",
    "BC Field Name": "Shipment on Invoice",
    "Question": "When posting a sales invoice, should the item shipment be posted automatically as well? (Yes to combine shipment with invoicing.)",
    "common": "Sometimes"
  },
  {
    "Field": "Invoice Rounding",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (usually)",
    "Considerations": "Specifies whether to apply invoice-level rounding to the total amount on sales invoices. Typically this is Off in the US, since line amounts and sales tax are already individually rounded and the total will be exact. If turned On, make sure the Invoice Rounding Precision (in General Ledger Setup) is set (for example $0.01 or $1.00) and that a Sales Rounding account is configured in posting setups. Most US businesses leave this Off because additional invoice total rounding is not needed.",
    "BC Field Name": "Invoice Rounding",
    "Question": "Do you want to enable invoice total rounding on sales invoices? (Usually No in US.)",
    "common": "Sometimes"
  },
  {
    "Field": "Ext. Doc. No. Mandatory",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (for sales side)",
    "Considerations": "Controls whether the External Document No. field (e.g., the customer’s PO number or reference) is required when posting sales invoices and credit memos. Many US businesses do not require this on sales documents, so the default is Off. Leave it Off unless the business specifically wants to enforce that every sales invoice/credit memo has a customer-provided reference. (Note: On the purchasing side, this is often turned On to require vendor invoice numbers.)",
    "BC Field Name": "Ext. Doc. No. Mandatory",
    "Question": "Should an External Document No. be required on sales invoices and credit memos? (Usually No.)",
    "common": "Sometimes"
  },
  {
    "Field": "Default Posting Date",
    "FieldType": "Option",
    "DefaultValue": "Work Date",
    "RecommendedSetting": "Work Date",
    "Considerations": "Sets the default posting date for new sales documents. Options: Work Date (the user's current work date, typically today’s date) or No Date (leave the posting date blank so the user must enter it manually). By default, Business Central uses the Work Date to auto-fill posting dates to today's date which streamlines data entry. It’s recommended to keep this as Work Date for efficiency, unless there’s a specific reason to force manual date entry on every document. Users can still change the date if needed (e.g. for backdating at period end).",
    "BC Field Name": "Default Posting Date",
    "Question": "What should the default posting date be on new sales documents? (Work Date (today) or None to require manual entry.)",
    "common": "Sometimes"
  },
  {
    "Field": "Default Quantity to Ship",
    "FieldType": "Option",
    "DefaultValue": "Remaining (implied)",
    "RecommendedSetting": "Remaining",
    "Considerations": "Specifies the default value for the Quantity to Ship on sales orders (and Return Qty. to Receive on return orders). If set to Remaining, whenever you create or refresh a shipment, the system auto-populates the full remaining quantity on each line to be shipped. If set to Blank, then by default nothing is set to ship and a user must manually enter quantities for each line. Generally, \"Remaining\" is recommended so that all available quantity is assumed to ship. Only choose Blank if users prefer to manually specify shipped quantities (for example, if partial shipments are the norm and you do not want the system to assume full shipment).",
    "BC Field Name": "Default Quantity to Ship",
    "Question": "On sales orders, should the Quantity to Ship default to the full remaining quantity, or be left blank by default?",
    "common": "Sometimes"
  },
  {
    "Field": "Customer Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series code, e.g. \"CUST\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"CUST\")",
    "Considerations": "Code for the number series used to assign new Customer IDs. Out of the box, this may be set to a default like \"CUST\". Ensure this is pointing to a valid number series with an appropriate format (for example, starting at CUST-10000). Adjust the series code if the client prefers a different customer numbering format. If blank, assign a number series.",
    "BC Field Name": "Customer Nos.",
    "Question": "Which number series code will be used for assigning new customer numbers?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Quote Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"S-QUO\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"QUOTE\" or similar)",
    "Considerations": "Number series code for sales quotes. Confirm that a series (for example, \"S-QUO\" for sales quotes) is assigned and properly configured. Adjust the code if needed (for example, to \"RQ\" or another code the company uses). If not using purchase quotes frequently, it can remain with a default but should not be blank if the feature is used.",
    "BC Field Name": "Quote Nos.",
    "Question": "Which number series code will be used for sales quotes?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"SO\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"SO\" for sales orders)",
    "Considerations": "Number series for sales orders. Typically a default like \"SO\" (Sales Order) is used. Ensure the series exists with a suitable format (such as SO-0001). If the business wants a specific numbering scheme (like including year or location codes), update the number series accordingly. Do not leave this blank; assign a series for order numbering.",
    "BC Field Name": "Order Nos.",
    "Question": "Which number series code will be used for sales orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Invoice Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"INV\" or \"SI\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"INV\")",
    "Considerations": "Number series for sales invoices. A default like \"INV\" (Invoice) or \"SI\" may be provided. Verify that this points to a valid series (e.g. starting at INV-1001 or similar). If the client prefers a custom invoice numbering (such as including a year or different prefix), adjust the series code and format. If no series is set, create/assign one to avoid manual numbering.",
    "BC Field Name": "Invoice Nos.",
    "Question": "Which number series code will be used for sales invoices?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Invoice Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"POSTINV\" or similar)",
    "Considerations": "Number series for posted sales invoices (historical invoice records). Ensure a series is defined. Often, businesses either use a distinct prefix for posted invoices (e.g. \"INV-\" continuing the same sequence or \"PSI\" for Posted Sales Invoice) or even allow it to share the same sequence as Invoice Nos. (some companies have the posted invoice keep the same number as the original invoice). By default, Cronus may set a separate series. Confirm and adjust according to the client's preference. The key is that a valid series is assigned so posted invoices can be created without error.",
    "BC Field Name": "Posted Invoice Nos.",
    "Question": "Which number series code will be used for posted sales invoices?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Credit Memo Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"CM\" for credit memos)",
    "Considerations": "Number series for sales credit memos. Typically Cronus might use \"CM\" or similar. Ensure a number series is assigned for credit memos (e.g. CM-0001). If the client wants a specific format (like prefix \"CR\" or separate numbering from invoices), configure the series accordingly. Do not leave blank if credit memos will be used.",
    "BC Field Name": "Credit Memo Nos.",
    "Question": "Which number series code will be used for sales credit memos?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Credit Memo Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"POSTCM\" or \"PCM\")",
    "Considerations": "Series for posted sales credit memos (the archived credit memo documents). Confirm a series is set (Cronus might have one like \"PCR\" for Posted Credit). Many companies use a similar code to credit memos (like prefix with a P or use same number as the credit memo itself). Ensure whatever approach, a valid series exists so posting credit memos assigns a number. Adjust format as needed to match any company standard.",
    "BC Field Name": "Posted Credit Memo Nos.",
    "Question": "Which number series code will be used for posted sales credit memos?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Shipment Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PS\" for posted shipments)",
    "Considerations": "Series for posted sales shipments. If the company ships goods (without immediate invoicing), each posted shipment will need a number. Cronus often provides a series like \"PS-\". Make sure a series code is assigned and properly set up (like PS-0001). If shipments are always invoiced immediately (shipment-on-invoice), this may be used less, but it should still be configured. Adjust prefix/format as desired.",
    "BC Field Name": "Posted Shipment Nos.",
    "Question": "Which number series code will be used for posted sales shipments?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Blanket Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"BSO\" for blanket sales orders)",
    "Considerations": "Number series for blanket sales orders. If the company uses blanket orders (framework orders), assign a series (Cronus might use something like \"BLA\" or \"BSO\"). If blanket orders are not used, this can remain unset, but it's good practice to have one in case. Ensure it’s set if needed, with an appropriate prefix.",
    "BC Field Name": "Blanket Order Nos.",
    "Question": "Which number series code will be used for blanket sales orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Return Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"SRET\" for sales returns)",
    "Considerations": "Series for sales return orders (RMAs). By default, Cronus may not display it in the setup list (mentioned as not visible above), but it's present in the table. Ensure a number series is assigned for return orders (e.g. prefix \"RET\" or \"SRET\"). This allows numbering of sales return orders. Set this up if the company will process returns.",
    "BC Field Name": "Return Order Nos.",
    "Question": "Which number series code will be used for sales return orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Return Receipt Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PRR\" for posted return receipts)",
    "Considerations": "Series for posted return receipts (the record of items received back from customers on returns). Ensure a series exists for this (for example, Cronus might have one). It's important if the company processes returns, so that when a return order is posted as received, it gets a proper document number. Configure this similar to other posted document series.",
    "BC Field Name": "Posted Return Receipt Nos.",
    "Question": "Which number series code will be used for posted return receipts (customer returns)?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Calc. Inv. Discount",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On (True)",
    "Considerations": "When enabled, invoice discount terms (configured on the customer card) are automatically applied to sales documents (quotes, orders, invoices). By default this is True. It should be kept On if you use invoice discount terms so the system can auto-calculate the discount when the document total qualifies. If the company does not use invoice-level discounts at all, you can turn it Off and it will have no effect (the system will not look for any invoice discount percentages to apply).",
    "BC Field Name": "Calc. Inv. Discount",
    "Question": "Should invoice discounts be automatically calculated on sales documents? (Yes if invoice discount terms are used.)",
    "common": "Sometimes"
  },
  {
    "Field": "Receipt on Invoice",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On (or per process needs)",
    "Considerations": "If On, posting a purchase invoice will automatically post the receipt of the items as well (so you can invoice & receive in one step). Default is generally On (allowing combined receipt+invoice posting). Keep it On if the company typically records vendor invoices at the time of receiving goods (common for simplicity when not separately managing receiving). If the company separates the receiving process (posting a Receipt note first, then invoicing later), set this to Off. In Off mode, users must post purchase receipts before they can post the purchase invoices.",
    "BC Field Name": "Receipt on Invoice",
    "Question": "When posting a purchase invoice, should it automatically post the receipt of the items as well? (Yes if receiving and invoicing together.)",
    "common": "Sometimes"
  },
  {
    "Field": "Ext. Doc. No. Mandatory (Purchases)",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On (True)",
    "Considerations": "Controls whether an External Document No. (usually the vendor’s invoice number) is required on purchase invoices and credit memos. While on the sales side this is often optional, on the purchasing side it's typically turned On so that every vendor invoice record in the system is tagged with the supplier’s invoice number (for audit and matching purposes). It’s recommended to enable this (True) for purchases, ensuring users must enter the vendor’s invoice number before posting a purchase invoice or credit memo. (Default is Off, but best practice is to turn it On for Accounts Payable processing.)",
    "BC Field Name": "Ext. Doc. No. Mandatory",
    "Question": "Should an External Document No. (vendor's invoice number) be required on purchase invoices and credit memos? (Usually Yes.)",
    "common": "Sometimes"
  },
  {
    "Field": "Vendor Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series code, e.g. \"VEND\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"VEND\")",
    "Considerations": "Number series for vendors. By default, a code like \"VEND\" might be provided. Ensure this points to a valid vendor number series (for example starting at VEND-10000). If the business prefers a different format for vendor IDs, set the series accordingly. Do not leave blank; assign a series for auto-numbering new vendors.",
    "BC Field Name": "Vendor Nos.",
    "Question": "Which number series code will be used for assigning new vendor numbers?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Quote Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"P-QUO\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"PQUO\")",
    "Considerations": "Number series for purchase quotes (requests for quotes or similar documents). Cronus might have a code like \"P-QUO\". Verify a series exists for purchase quotes. Adjust the code if needed (for example, to \"RQ\" or another code the company uses). If not using purchase quotes frequently, it can remain with a default but should not be blank if the feature is used.",
    "BC Field Name": "Quote Nos.",
    "Question": "Which number series code will be used for purchase quotes?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Order Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"PO\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"PO\" for purchase orders)",
    "Considerations": "Number series for purchase orders. Typically provided as \"PO\". Ensure it’s assigned to a valid series (like PO-0001). Modify the format or code if the client wants a specific purchase order numbering scheme. This should be set so that new POs get auto-numbered.",
    "BC Field Name": "Order Nos.",
    "Question": "Which number series code will be used for purchase orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Invoice Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series, e.g. \"PINV\")",
    "RecommendedSetting": "Use meaningful code (e.g. \"PINV\")",
    "Considerations": "Series for purchase invoices. Often defaulted to something like \"PINV\". Make sure this series is in place (e.g. PINV-1001). The format can be adjusted if the company wants a different code for vendor invoices. It’s important to have this assigned so that posted purchase invoices (and unposted ones) have unique numbers.",
    "BC Field Name": "Invoice Nos.",
    "Question": "Which number series code will be used for purchase invoices?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Invoice Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PPINV\")",
    "Considerations": "Number series for posted purchase invoices. Confirm a series is set, such as a variant of the purchase invoice series (some might use the same number as the invoice or a prefix like \"PI-\" for posted invoice). Typically, ensure a distinct series or the same one, per company preference, is assigned so that when purchase invoices are posted, they receive appropriate document numbers. Adjust if the client wants posted invoices numbered differently from the pre-posting invoice.",
    "BC Field Name": "Posted Invoice Nos.",
    "Question": "Which number series code will be used for posted purchase invoices?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Credit Memo Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PCM\" for purchase credit memos)",
    "Considerations": "Series for purchase credit memos. Cronus might provide a default like \"PCM\". Ensure it exists (e.g. PCM-0001). If the business has a particular numbering scheme for vendor credit memos, implement it here. This field should have a series if purchase credit memos will be used.",
    "BC Field Name": "Credit Memo Nos.",
    "Question": "Which number series code will be used for purchase credit memos?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Credit Memo Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PPCM\")",
    "Considerations": "Series for posted purchase credit memos. Verify that a series is assigned (maybe a prefix of the credit memo number or a separate sequence). For example, a default might be PCR- for posted purchase credits. If none is set, assign one. Align this with the unposted credit memo series logic (some keep the same number on posting, others use a new sequence).",
    "BC Field Name": "Posted Credit Memo Nos.",
    "Question": "Which number series code will be used for posted purchase credit memos?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Receipt Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PR\" for posted receipts)",
    "Considerations": "Number series for posted purchase receipts (goods received notes). Make sure a series is defined (Cronus often uses something like \"PR-\" or similar). When items are received (but not yet invoiced), the posted receipt will get a number from this series. Adjust the code/prefix if needed to fit the company's nomenclature. Ensure it’s not blank if receiving inventory is part of the process.",
    "BC Field Name": "Posted Receipt Nos.",
    "Question": "Which number series code will be used for posted purchase receipts?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Blanket Order Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"BPO\" for blanket purchase orders)",
    "Considerations": "Series for blanket purchase orders. If the company uses blanket POs (long-term agreements), define a series (like BPO-0001). Cronus might have a default. If blanket orders are not used, this could remain unset, but best to configure if there's any chance they'll use them. Use a code that differentiates it from regular POs.",
    "BC Field Name": "Blanket Order Nos.",
    "Question": "Which number series code will be used for blanket purchase orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Return Order Nos. (Purchases)",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PRET\" for purchase returns)",
    "Considerations": "Series for purchase return orders. Ensure a series exists (for example, PRET-0001 for purchase returns). This is used when returning items to a vendor. If the company might process vendor returns, set this up. If left blank, you would need to assign it before posting any purchase return order.",
    "BC Field Name": "Return Order Nos.",
    "Question": "Which number series code will be used for purchase return orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Return Shpt. Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset series)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PRSH\" for posted return shipments)",
    "Considerations": "Series for posted purchase return shipments (documents confirming goods sent back to vendor). Verify that a number series is defined (Cronus might use a code like PRS-). If the business will process returns to vendors, configure this so that when a return order is posted, the posted return shipment is numbered properly. Adjust prefix as needed. Do not leave blank if returns are part of the process.",
    "BC Field Name": "Posted Return Shpt. Nos.",
    "Question": "Which number series code will be used for posted return shipments (to vendors)?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Prepayment Inv. Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Blank or preset)",
    "RecommendedSetting": "Assign series if using prepayments",
    "Considerations": "Number series for posted prepayment invoices (sales or purchase prepayments). If the company uses prepayments on orders, ensure this is filled. For example, you might use a prefix like PPI- for posted prepayment invoices. By default, this might be blank in Cronus. Set up a series so that when a prepayment invoice is posted, it gets a unique number. If prepayments are not used, this can remain blank.",
    "Comment": "Used in Sales & Receivables and Purchases & Payables setups for posted prepayment invoices.",
    "BC Field Name": "Posted Prepayment Inv. Nos.",
    "Question": "Which number series code will be used for posted prepayment invoices? (If using prepayments.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Posted Prepayment Cr. Memo Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Blank or preset)",
    "RecommendedSetting": "Assign series if using prepayments",
    "Considerations": "Series for posted prepayment credit memos. If prepayment credit memos (reversals of prepayments) are a scenario, configure a series (e.g. PPCM-0001). This may be blank by default, so define it to ensure posted prepayment credits can be numbered. If the business does not use prepayments at all, it can remain blank.",
    "Comment": "Used in Sales & Receivables and Purchases & Payables setups for posted prepayment credit memos.",
    "BC Field Name": "Posted Prepayment Cr. Memo Nos.",
    "Question": "Which number series code will be used for posted prepayment credit memos? (If using prepayments.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Receipt Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using warehouse receipts",
    "Considerations": "Number series for Warehouse Receipts (when receiving inventory in advanced warehousing). For example, a code like \"WHS-REC\" might be used. Ensure a series is present if the company uses warehouse receipts to log inbound shipments. If the business does not use advanced warehouse processes, this can be left blank.",
    "Comment": "Corresponds to \"Whse. Receipt Nos.\" in Warehouse Setup.",
    "BC Field Name": "Whse. Receipt Nos.",
    "Question": "Which number series code will be used for warehouse receipts? (If using advanced warehouse receiving.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Put-away Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using put-aways",
    "Considerations": "Series for Warehouse Put-away documents (used in advanced warehousing to move received items to storage). If using directed put-away processes, set this to a code (e.g. \"WHS-PUT\"). If not using warehouse put-aways, this can be blank.",
    "Comment": "Corresponds to \"Whse. Put-away Nos.\"",
    "BC Field Name": "Whse. Put-away Nos.",
    "Question": "Which number series code will be used for warehouse put-aways? (If using warehouse put-away documents.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Pick Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using picks",
    "Considerations": "Series for Warehouse Picks (picking lists in advanced warehousing). If the warehouse uses pick documents, assign a series (e.g. \"WHS-PICK\"). If the company doesn't use separate pick documents (e.g., ships directly from orders without picks), this can remain blank.",
    "Comment": "Corresponds to \"Whse. Pick Nos.\"",
    "BC Field Name": "Whse. Pick Nos.",
    "Question": "Which number series code will be used for warehouse picks? (If using warehouse pick documents.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Movement Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using movements",
    "Considerations": "Series for Warehouse Movements (internal warehouse movements). If advanced warehousing is enabled and internal movements of inventory are recorded, assign a series code (e.g. \"WHS-MOVE\"). If not in use, leave blank.",
    "Comment": "Corresponds to \"Whse. Movement Nos.\"",
    "BC Field Name": "Whse. Movement Nos.",
    "Question": "Which number series code will be used for warehouse movements? (If using internal warehouse movements.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Registered Put-away Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using put-aways",
    "Considerations": "Series for registered warehouse put-aways (posted confirmation of put-away). If warehouse put-aways are used, ensure a series exists for when they are registered (completed). If the company doesn't use this process, leave blank.",
    "Comment": "Corresponds to \"Registered Whse. Put-away Nos.\"",
    "BC Field Name": "Registered Whse. Put-away Nos.",
    "Question": "Which number series code will be used for registered (posted) warehouse put-aways? (If using them.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Registered Pick Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using picks",
    "Considerations": "Series for registered warehouse picks (posted confirmation of picking). If using picks, set up a series for when they are registered as done. If not used, leave blank.",
    "Comment": "Corresponds to \"Registered Whse. Pick Nos.\"",
    "BC Field Name": "Registered Whse. Pick Nos.",
    "Question": "Which number series code will be used for registered (posted) warehouse picks? (If using them.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Registered Movement Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Assign if using movements",
    "Considerations": "Series for registered warehouse movements (confirmation of internal movements). If internal warehouse movements are recorded and completed, assign a series. If not applicable, leave blank.",
    "Comment": "Corresponds to \"Registered Whse. Movement Nos.\"",
    "BC Field Name": "Registered Whse. Movement Nos.",
    "Question": "Which number series code will be used for registered (posted) warehouse movements? (If using them.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Simulated Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes, e.g. \"SIM\")",
    "RecommendedSetting": "Verify/assign (e.g. \"SIM\")",
    "Considerations": "Number series for Simulated Production Orders (what-if costing scenarios). Ensure a series is set (Cronus might use \"SIM-\"). These orders are used for simulation and cost estimation. Set a prefix like SIM to clearly identify them. If the company will do \"what-if\" production orders, this needs a series.",
    "Comment": "Used in Manufacturing for hypothetical production orders.",
    "BC Field Name": "Simulated Order Nos.",
    "Question": "Which number series code will be used for simulated (what-if) production orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Planned Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes, e.g. \"PLAN\")",
    "RecommendedSetting": "Verify/assign (e.g. \"PLAN\")",
    "Considerations": "Series for system-suggested Planned Production Orders (from MRP/MPS planning). Cronus often uses \"PLN-\" or similar. Check that a series is assigned so when MRP generates planned orders, they get numbers. Use a code like PLAN for clarity. If the company uses automatic planning, this should be configured.",
    "Comment": "Used in Manufacturing for system-generated planned orders.",
    "BC Field Name": "Planned Order Nos.",
    "Question": "Which number series code will be used for planned production orders (MRP suggestions)?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Firm Planned Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes, e.g. \"FPLAN\")",
    "RecommendedSetting": "Verify/assign (e.g. \"FPLAN\")",
    "Considerations": "Series for Firm Planned Production Orders. Once a planned order is reviewed and firmed up, it gets a number from this series. Ensure a series exists (e.g. FPLAN-0001). Cronus might use FPL- or similar. If firm planned orders are part of the process, set this accordingly.",
    "Comment": "Used in Manufacturing for firm planned production orders.",
    "BC Field Name": "Firm Planned Order Nos.",
    "Question": "Which number series code will be used for firm planned production orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Released Order Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes, e.g. \"PROD\")",
    "RecommendedSetting": "Verify/assign (e.g. \"PROD\")",
    "Considerations": "Series for Released Production Orders (actual production orders ready for execution). Typically a prefix like PROD- or REL- is used. Make sure this is assigned (Cronus might use \"REL-\"). This is crucial as every actual production order will draw from this series when released. Adjust to the company's desired naming (e.g. \"PROD\" or \"WO\" for work order).",
    "Comment": "Used in Manufacturing for released (active) production orders.",
    "BC Field Name": "Released Order Nos.",
    "Question": "Which number series code will be used for released production orders?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Work Center Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Use meaningful code (e.g. \"WC\")",
    "Considerations": "Series for Work Center numbers (production work centers). Ensure a numbering scheme is defined (for example, WC-001). By default, Cronus might start these manually, but you can assign a series to automatically number new work centers. Use a code that fits the naming convention for work centers (e.g., a prefix like WC).",
    "BC Field Name": "Work Center Nos.",
    "Question": "Which number series code will be used for new Work Centers?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Machine Center Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Use meaningful code (e.g. \"MC\")",
    "Considerations": "Series for Machine Center numbers (individual machines or capacity centers under a work center). If auto-numbering machine centers, set a series (e.g. MC-001). If not, they can be created manually. Cronus might not have a default series, so define one if many machine centers will be added to ensure consistency.",
    "BC Field Name": "Machine Center Nos.",
    "Question": "Which number series code will be used for new Machine Centers?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Production BOM Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Use meaningful code (e.g. \"PBOM\")",
    "Considerations": "Series for Production Bills of Material (BOM) IDs. A default might be present (like BOM-). Ensure a series is in place for numbering new production BOMs (e.g. BOM-001 or PBOM-0001). If the company has a specific way to code BOMs, adjust accordingly. Having this helps to uniquely identify BOMs as they're created.",
    "BC Field Name": "Production BOM Nos.",
    "Question": "Which number series code will be used for Production BOMs?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Routing Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Preset codes)",
    "RecommendedSetting": "Use meaningful code (e.g. \"ROUT\")",
    "Considerations": "Series for Routing IDs (sequences of operations for production). Make sure a series exists (e.g. R-0001 or ROUT-001). This allows new routings to be numbered automatically. If the business prefers manual routing codes, this can be optional, but usually numbering helps maintain consistency.",
    "BC Field Name": "Routing Nos.",
    "Question": "Which number series code will be used for Routings?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "FA Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Blank or preset)",
    "RecommendedSetting": "Assign a series (e.g. \"FA\")",
    "Considerations": "Number series for new Fixed Asset IDs. You should set this so that new fixed assets get an auto-assigned number. For example, use \"FA\" as a prefix (FA-0001). If left blank, asset numbers must be entered manually. Using a series ensures consistency and uniqueness of asset numbers.",
    "Comment": "Fixed Asset number series.",
    "BC Field Name": "Fixed Asset Nos.",
    "Question": "Which number series code will be used for new Fixed Assets?",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "Depreciation Book Nos.",
    "FieldType": "Code",
    "DefaultValue": "(Blank or preset)",
    "RecommendedSetting": "Assign if adding many depreciation books",
    "Considerations": "Number series for Depreciation Book codes (if automatically creating multiple depreciation books). Typically, depreciation books have specific names (e.g., TAX, GAAP) and might not require a numeric series. However, if you plan to auto-generate codes for new depreciation books, set a series. Otherwise, this can remain blank and depreciation books are created with manual codes.",
    "Comment": "Not always used; depreciation books often have named codes.",
    "BC Field Name": "Depreciation Book Nos.",
    "Question": "Which number series code will be used for Depreciation Books? (If auto-numbering them.)",
    "common": "Very Common",
    "Lookup Table": 308,
    "Lookup Field": "Code"
  },
  {
    "Field": "FA Journal Batch Name",
    "FieldType": "Code",
    "DefaultValue": "(Default batch)",
    "RecommendedSetting": "Use a default batch (e.g. \"DEFAULT\")",
    "Considerations": "Specifies the default Journal Batch to use for Fixed Asset transactions (like depreciation or acquisition posting) if automatic processes are run. Cronus typically has a default FA journal batch (e.g., \"DEFAULT\" in the FA G/L Journal). Ensure that an FA journal template and batch exist (e.g., Template = FA GENERAL, Batch = DEFAULT) for processes like Calculate Depreciation to use. If left blank or not properly set, those processes might prompt for a batch. It's usually covered by default settings in Cronus, but verify it aligns with the batch the client will use for FA postings.",
    "Comment": "Ensure the existence of an FA journal template & batch for automated FA postings.",
    "BC Field Name": "FA Journal Batch Name",
    "Question": "Which Fixed Asset journal batch should be the default for automatic FA postings? (e.g., DEFAULT.)",
    "common": "Sometimes",
    "Lookup Table": 5620,
    "Lookup Field": "Name"
  },
  {
    "Field": "Copy Comments Blanket Order to Order",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On if you want blanket order comments on orders",
    "Considerations": "If True, any comments on a Blanket Sales Order will be automatically copied to the Sales Order created from it. Default is False. Turn it On if the company uses Blanket Orders and wants any notes or instructions from the blanket to carry into the actual order. Leave Off if not needed or if blanket orders are rarely used.",
    "BC Field Name": "Copy Comments Blanket to Order",
    "Question": "When converting a blanket sales order to a sales order, should any comments be copied over automatically?",
    "common": "Sometimes"
  },
  {
    "Field": "Copy Comments Order to Invoice",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On if you want order comments on invoices",
    "Considerations": "If True, comments on a Sales Order will copy over to the Sales Invoice when the order is invoiced. Default is Off. It's common to enable this (set to True) so that any internal or external notes on the order (like special instructions or terms) appear on the invoice. This ensures important information carries through to the billing document.",
    "BC Field Name": "Copy Comments Order to Invoice",
    "Question": "When posting a sales order as invoiced, should comments from the order be copied to the sales invoice?",
    "common": "Sometimes"
  },
  {
    "Field": "Copy Comments Order to Shipment",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On if you want order comments on shipments",
    "Considerations": "If True, comments on a Sales Order will be transferred to the Posted Shipment document. Default Off. Enable this if it’s important that any notes on the order (perhaps delivery instructions) also show on packing slips/posted shipment documents. If shipments are not heavily used or comments aren’t needed on them, it can remain Off.",
    "BC Field Name": "Copy Comments Order to Shpt.",
    "Question": "When posting a sales order shipment, should comments from the order be copied to the posted shipment document?",
    "common": "Sometimes"
  },
  {
    "Field": "Archive Quotes",
    "FieldType": "Boolean",
    "DefaultValue": "On (True)",
    "RecommendedSetting": "On (recommended)",
    "Considerations": "When enabled, any Sales Quote that is deleted or converted (e.g. to an order) will be archived automatically. By default, Business Central often has this On (so that you keep copies of quotes for record-keeping even if they are no longer active). It’s recommended to leave this On so that there is a history of quotes, especially if quotes can be lost or overwritten.",
    "BC Field Name": "Archive Quotes",
    "Question": "Should sales quotes be archived automatically when they are deleted or converted to orders?",
    "common": "Sometimes"
  },
  {
    "Field": "Archive Orders",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On (recommended)",
    "Considerations": "If enabled, when a Sales Order is posted (fully shipped/invoiced) or deleted, the system will save an archived copy of that order. By default this might be Off (to save space), but it is generally advisable to turn it On to maintain an audit trail. Archiving orders lets you review the original order details even after posting. The performance and storage impact is minimal, so enabling is usually beneficial for traceability.",
    "BC Field Name": "Archive Orders",
    "Question": "Should sales orders be archived automatically when fully posted (or deleted)?",
    "common": "Sometimes"
  },
  {
    "Field": "Archive Return Orders",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "On (recommended)",
    "Considerations": "If enabled, when a Sales Return Order is posted (or deleted), an archived copy is kept. Default is typically Off. It’s recommended to enable this if return orders are used, so you have a record of the original return request after it's processed. As with archiving orders, the overhead is small and it helps preserve historical data.",
    "BC Field Name": "Archive Return Orders",
    "Question": "Should sales return orders be archived automatically when posted (or deleted)?",
    "common": "Sometimes"
  },
  {
    "Field": "Allow VAT Difference",
    "FieldType": "Boolean",
    "DefaultValue": "Off (False)",
    "RecommendedSetting": "Off (for US)",
    "Considerations": "Specifies whether manual adjustment of VAT amounts is allowed on sales documents. In a VAT scenario (like in some countries), turning this On lets users edit the calculated VAT amount to adjust for rounding differences. In the US, this is not applicable (sales tax differences are handled via the tax area setup and there's generally no manual tax adjustment needed). Therefore, it should remain Off for US companies.",
    "BC Field Name": "Allow VAT Difference",
    "Question": "Should users be allowed to manually adjust VAT amounts on sales/purchase documents? (Usually No in US.)",
    "common": "Sometimes"
  }
]
